DataProcessors/ОтображениеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ОтображениеДанных</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ОтображениеДанных/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПримерДанных");
	ТестовыеДанные = Обработки.Тестирование_ГенераторДанных.Создать().СоздатьДанныеПоТабличномуДокументу(Макет);
	
	Объект.ТабличнаяЧасть1.Загрузить(ТестовыеДанные.ПримерДанных);
	
	ОтобразитьНаСервере();
	
КонецПроцедуры



&НаСервере
Процедура ОтобразитьНаСервере()
	
	тИдентификаторыКолонок = ОтображениеДанных.ПолучитьИдентификаторыДанных(
										Объект.ТабличнаяЧасть1.Выгрузить(), 
										"Склад");
	тОтображение = ОтображениеДанных.ТрансформироватьДанныеВОтображение(
										Объект.ТабличнаяЧасть1.Выгрузить(), 
										тИдентификаторыКолонок, 
										"Товар", 
										"Количество");
	
	
	ПрограммнаяРаботаСИнтерфейсом.ОбновитьТаблицуНаФормеПоТаблицеЗначений(ЭтаФорма, "ИдентификаторыКолонок", тИдентификаторыКолонок);
	ПрограммнаяРаботаСИнтерфейсом.ОбновитьТаблицуНаФормеПоТаблицеЗначений(ЭтаФорма, "Отображение", тОтображение);
										
КонецПроцедуры

&НаКлиенте
Процедура Отобразить(Команда)
	ОтобразитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	тДанные = ОтображениеДанных.ТрансформироватьОтображениеВДанные(
										Отображение.Выгрузить(), 
										ИдентификаторыКолонок.Выгрузить(), 
										"Количество");
	Объект.ТабличнаяЧасть1.Загрузить(тДанные);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
КонецПроцедуры
